// Used by interests-scatter.js
var jsonData = [

  //Q1 - ТРЕБА, ХОЧУ
  { interest: 'Релігії', треба: 1, хочу: 3 },
  { interest: 'Подорожі', треба: 1, хочу: 6 },
  { interest: 'Книжки', треба: 2, хочу: 1 },

  //Q2 - НЕ треба, ХОЧУ
  { interest: 'Генеалогія', треба: -1, хочу: 10 },
  { interest: 'Генетика', треба: -6, хочу: 9 },
  { interest: 'Історія', треба: -2, хочу: 8 },
  { interest: 'Етимологія', треба: -3, хочу: 7 },
  { interest: 'Картографія', треба: -1, хочу: 6 },
  { interest: 'Філософія', треба: -8, хочу: 4 },
  { interest: 'Музика', треба: -10, хочу: 9 },
  { interest: 'Overtone', треба: -10, хочу: 7 },
  { interest: 'English', треба: -4, хочу: 10 },
  { interest: 'Polska', треба: -5, хочу: 8 },
  { interest: 'Deutsch', треба: -5, хочу: 6 },
  { interest: 'Латинь', треба: -5, хочу: 4 },
  { interest: 'Блоги', треба: -8, хочу: 10 },
  { interest: 'Психологія', треба: -7, хочу: 5 },
  { interest: 'Сноуборд', треба: -6, хочу: 1 },
  { interest: 'Зодіак', треба: -10, хочу: 5 },
  { interest: 'Робота', треба: -2, хочу: 4 },
  { interest: 'Комп\'ютер', треба: -1, хочу: 2 },
  { interest: 'Фізіогноміка', треба: -10, хочу: 2 },

  //Q3 - НЕ треба, НЕ хочу
  { interest: 'Фотографії', треба: -8, хочу: -1 },
  { interest: 'Політика', треба: -5, хочу: -5 },
  { interest: 'Французька', треба: -7, хочу: -2 },
  { interest: 'Бізнес', треба: -1, хочу: -10 },
  { interest: 'Менеджмент', треба: -3, хочу: -10 },
  { interest: 'Космос', треба: -10, хочу: -1 },

  //Q4 - ТРЕБА, НЕ хочу
  { interest: 'Одружитись', треба: 10, хочу: -4 },
  { interest: 'Здоровя', треба: 10, хочу: -9 },
  { interest: 'Їда', треба: 1, хочу: -2 },
  { interest: 'Машина', треба: 8, хочу: -2 },
  { interest: 'Квартира', треба: 7, хочу: -1 },
  { interest: 'Будинок', треба: 3, хочу: -8 },
  { interest: 'Відпочинок', треба: 9, хочу: -3 },
  { interest: 'Ранкові Пробіжки', треба: 5, хочу: -1 },

];

// Used by interests-cloud.js
var jsonDataMapped = jsonData.map(function (elem, index, arr) {
  const newObj = {
    text: elem.interest,
    size: (elem.хочу + 20),
    // size: (elem.треба + 20),
  };
  return newObj;
});

